In [4]:
import pandas as pd

In [5]:
df = pd.read_excel('/home/trishalaswain/Documents/final_join.xlsx', index_col=False)

In [6]:
df

      accountNumber EANDM_Final
0         350950273         NaN
1         350935621       99238
2         350950094       99284
3         350950159         NaN
4         350950099       99284
...             ...         ...
3143      350952941       99285
3144      350944849       99285
3145      350950392       99282
3146      350949299       99283
3147      350947818       99285

[3148 rows x 2 columns]

In [7]:
df.sheet_accounts = df.accountNumber.astype('str')
df.EANDM_Final = df.EANDM_Final.astype('str')

/tmp/ipykernel_51534/1288796313.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.sheet_accounts = df.accountNumber.astype('str')

In [8]:
df1 = df.groupby(['accountNumber'], axis=0).agg(', '.join)

In [9]:
df1

                EANDM_Final
accountNumber
200009347             99284
200009352             99285
200009353             99284
350881436             99284
350882144             99284
...                     ...
350955531        99223, nan
350955533      99284, 99222
350955539             99285
350955540             99284
350956067             99291

[3041 rows x 1 columns]

In [10]:
df1.to_excel('/home/trishalaswain/Documents/test.xlsx')